import '../items/ekteran_item.dart';

List ekteranData = [


  EkteranItem("مايو", "27 - مايو", "(27) حادي على الماء منادي", 5),
  EkteranItem("حزيران", "25 - حزيران", "(25) القيظ", 3),
  EkteranItem("تموز", "23 - تموز", "(23) الجوزاء", 3),
  EkteranItem("أغسطس", "21 - اغسطس", "(21) سهيل", 3),
  EkteranItem("سبتمبر", "19 - سبتمبر", "(19) الصفري", 4),
  EkteranItem("أكتوبر", "17 - اكتوبر", "(17) الوسم", 4),
  EkteranItem("نوفمبر", "15 - نوفمبر", "(15) الجوزاوي", 4),
  EkteranItem("ديسمبر", "13 - ديسمبر", "(13)  الشتاء", 1),
  EkteranItem("يناير", "11 - يناير", "(11)  حادي برد بادي", 1),
  EkteranItem("فبراير", "9 - فبراير", "(9)  تاسع برد لاسع", 1),

  EkteranItem("مارس", "سابع مجيع وشابع أول الشهر \n خامس ربيع غامس أخر الشهر  ",
      "سابع مجيع وشابع أول الشهر\nخامس ربيع غامس أخر الشهر", 2),




  EkteranItem("أبريل", "3 - ابريل", "(3)  ثالث ربيع ذالف", 2),
  EkteranItem("مايو", "27 - مايو", "(27)  حادي على الماء منادي", 5),














];
