import 'package:flutter/cupertino.dart';
import 'package:new_moon_app/model/fasoul.dart';

final Fasoul_data = [
  Myfasoul('أولًا - فصل الشتاء: ٩١ يومًا', '١٩ ديسمبر',
      'assets/images/sitaa.jpeg', 7, 2, 91, 'الشتاء'),
  Myfasoul('ثانيًا - فصل الربيع: ٩٢ يومًا', '١٩ مارس',
      'assets/images/rabie.jpeg', 7, 4, 92, 'الربيع'),
  Myfasoul('ثالثًا - فصل الصيف: ٩٢ يومًا', ' ١٩ يونيو',
      'assets/images/summer_6.jpg', 7, 1, 92, 'الصيف'),
  Myfasoul('رابعًا - فصل الخريف: ٩١ يومًا', '١٩ سبتمبر',
      'assets/images/kraif.jpg', 7, 3, 91, 'الخريف'),
];
final fasoul_desc = [
  Myfasouldsec(
      'أولاً - فصل الشتاء : ٩١ يومًا بداية فصل الشتاء فلكيًا: حينما تتعامد الشمس على مدار الجدي في ١٩ ديسمبر - كانون أول •- فترة الانقلاب الشتوي : ثلاثة أسابيع تقريبًا من أول ديسمبر • جويريد : ثلاثة عشر يومًا "٧ - ١٩" ديسمبر قران ثالث عشر: ٨ ديسمبر وهوبداية فصل الشتاء بالعرف وبشكل عام•المربعانية: تبدأ مربعانية الشتاء بالحساب العرفي التقريبي، من ٧ ديسمبر  إلى ١٤ يناير، مدتها: ٣٩ يومًا،  وهي ثلاثة نجوم: ١-الإكليل ٢-القلب ٣-الشولة وفي الحساب الفلكي ٤٠ يومًا  من ١٩ديسمبر إلى نهاية ٢٧ يناير',
      2),
  Myfasouldsec(
      ' فصل الربيع: ٩٢ يومًا بداية فصل الربيع فلكيًا: حينما تتعامد الشمس على خط الإستواء في ١٩ مارس – آذار -فترة الانقلاب الربيع: ثلاثة أسابيع تقريبا من أول مارس •موسم السماك ، ٥٢ يوما من أول مارس – آذار وبداية مارس هو قران سابع مجيع وشابع، وفي الثلث الأخير تقريبا هو قران خامس بالربيع غامس',
      4),
  Myfasouldsec(
      'فصل الصـــيـف : ٩٢ يومًا حين تتعامد الشمس على مدار السرطان ١٩ يونيو -أول ثلاثة أسابيع منه تسمى فترة الانقلاب الصيفي : -مربعانية القيظ : بالحساب التقريبي ثلاثة نجوم : الثريا، الدبران، الهقعة ٣٩ يومًا وبالحساب الفلكي أربعون يومًا، ١٩ يونيو - نهاية ٢٨ يوليو قران القيظ:  قران ٢٥ حزيران نجوم الصيف:',
      1),
  Myfasouldsec(
      ' فصل الصـــيـف : ٩٢ يومًا حين تتعامد الشمس على مدار السرطان ١٩ يونيو -أول ثلاثة أسابيع منه تسمى فترة الانقلاب الصيفي : -مربعانية القيظ : بالحساب التقريبي ثلاثة نجوم : الثريا، الدبران، الهقعة ٣٩ يومًا وبالحساب الفلكي أربعون يومًا، ١٩ يونيو - نهاية ٢٨ يوليو قران القيظ:  قران ٢٥ حزيران نجوم الصيف:',
      1),
  Myfasouldsec(
      ' فصل الخـــريـف: ٩١ يومًا الفترة الأولى: بداية نجم الجبهة، الثاني من نجوم سهيل، والأول من نجوم الخريف قران دخول الخريف قران ١٩  ب١٩ سبتمبر – أيلول الاعتدال الخريفي : بدايته فلكيًا ١٩سبتمبر - ١٨ ديسمبر حينما تتعامد الشمس على خط الإستواء في ١٩ سبتمبر – أيلول - موسم الصفري : ٢٦ يوماً "١٩ سبتمبر - ١٥ أكتوبر" ينبت الفقع والعشب بإنواعه إذا سالت الأرض بنجم الصرفة أول ثلاثة أسابيع تقريبا من سبتمبر فترة انقلاب خريفي',
      3)
];
